In [1]:
import pandas as pd
import numpy as np

# Series object

In [6]:
sales = pd.Series([100, 200, 500, 300])

print(sales)

0    100
1    200
2    500
3    300
dtype: int64

In [7]:
print(sales.values)

[100 200 500 300]

In [8]:
print(sales.index)

RangeIndex(start=0, stop=4, step=1)

In [9]:
sales = pd.Series([100, 200, 500, 300], index = ['Jan', 'Feb', 'Mar', 'Apr'], name = '4 months sale')

print(sales)
print(sales.values)
print(sales.index)

Jan    100
Feb    200
Mar    500
Apr    300
Name: 4 months sale, dtype: int64
[100 200 500 300]
Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')

In [6]:
# Create a pandas series to store a canteen data to hold values of how many sandwitches are sold each days(one week)

In [10]:
sw = pd.Series([20, 30, 20, 25, 40, 35, 0], 
              index = ['Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat', 'Sun'])
print(sw)

Mon    20
Tue    30
Wed    20
Thr    25
Fri    40
Sat    35
Sun     0
dtype: int64

In [11]:
print(sw[1])

print(sw['Tue'])

print(sw['Sun'])

print(sw[sw > 20])      # for multiple index for selecting element

30
30
0
Tue    30
Thr    25
Fri    40
Sat    35
dtype: int64

In [12]:
sw * 2

Mon    40
Tue    60
Wed    40
Thr    50
Fri    80
Sat    70
Sun     0
dtype: int64

In [13]:
print(sw)

sw = sw * 2
print(sw)

Mon    20
Tue    30
Wed    20
Thr    25
Fri    40
Sat    35
Sun     0
dtype: int64
Mon    40
Tue    60
Wed    40
Thr    50
Fri    80
Sat    70
Sun     0
dtype: int64

In [14]:
'Mon' in sw

True

In [15]:
import numpy as np

arr = np.array([3, 5, 4, 6, 7])
ind = np.array(['a', 'b', 'c', 'd', 'e'])

obj2 = pd.Series(arr, index = ind)
print(obj2)

a    3
b    5
c    4
d    6
e    7
dtype: int32

In [16]:
sdata = {'Sindh': 3500, 'Punjab': 600, 'KPK': 4500, 'Balochistan': 2000 }
tax_by_state = pd.Series(sdata)

print(tax_by_state)
print(tax_by_state.index)

Sindh          3500
Punjab          600
KPK            4500
Balochistan    2000
dtype: int64
Index(['Sindh', 'Punjab', 'KPK', 'Balochistan'], dtype='object')

In [17]:
sdata = {'Sindh': 3500, 'Punjab': 600, 'KPK': 4500, 'Balochistan': 2000 }
tax_by_state = pd.Series(sdata, index = ['Punjab', 'Sindh', 'KPK', 'Balochistan', 'GB'])

print(tax_by_state)

Punjab          600.0
Sindh          3500.0
KPK            4500.0
Balochistan    2000.0
GB                NaN
dtype: float64

In [18]:
# NAN values mean, values does not exist in pandas Series

print(pd.isnull(tax_by_state))

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

# Data Frame

In [19]:
import pandas as pd

In [20]:
apples = pd.Series([3, 2, 0, 1])
oranges = pd.Series([3, 2, 0, 1])

# print(apples, oranges)

data = {"Apples": apples, "Oranges": oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

   Apples  Oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [21]:
state = ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']

data = {'State': state, 
       'Year': [2000, 2001, 2002, 2003, 2000, 2002], 
       'Pop': [1.5, 1.7, 3.5, 2.4, 2.9, 3.4]}
frame = pd.DataFrame(data, index = ['1st', '2nd', '3rd', '4th', '5th', '6th'])

print(frame)

      State  Year  Pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.5
4th  Nevada  2003  2.4
5th  Nevada  2000  2.9
6th  Nevada  2002  3.4

In [22]:
frame = pd.DataFrame(data, 
                     index = ['1st', '2nd', '3rd', '4th', '5th', '6th'], 
                     columns = ['Year', "State", "Pop", "debt"])

In [23]:
frame.head()

     Year   State  Pop debt
1st  2000    Ohio  1.5  NaN
2nd  2001    Ohio  1.7  NaN
3rd  2002    Ohio  3.5  NaN
4th  2003  Nevada  2.4  NaN
5th  2000  Nevada  2.9  NaN

In [24]:
# dict-like style of accessing column

frame['State']

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: State, dtype: object

In [25]:
# Attribute style of accessing column

frame.State

1st      Ohio
2nd      Ohio
3rd      Ohio
4th    Nevada
5th    Nevada
6th    Nevada
Name: State, dtype: object

In [26]:
frame.loc['1st']

Year     2000
State    Ohio
Pop       1.5
debt      NaN
Name: 1st, dtype: object

In [27]:
print(len(frame))

6

In [28]:
val = pd.Series([-1.2, -2.5, -1.7, -1.9, -2.3, -2.2], 
               index = ['1st', '2nd', '3rd', '4th', '5th', '6th'])
frame['debt'] = val

frame

     Year   State  Pop  debt
1st  2000    Ohio  1.5  -1.2
2nd  2001    Ohio  1.7  -2.5
3rd  2002    Ohio  3.5  -1.7
4th  2003  Nevada  2.4  -1.9
5th  2000  Nevada  2.9  -2.3
6th  2002  Nevada  3.4  -2.2

In [29]:
frame['debt'] = 16.5

frame

     Year   State  Pop  debt
1st  2000    Ohio  1.5  16.5
2nd  2001    Ohio  1.7  16.5
3rd  2002    Ohio  3.5  16.5
4th  2003  Nevada  2.4  16.5
5th  2000  Nevada  2.9  16.5
6th  2002  Nevada  3.4  16.5

## Function application and Mapping

In [30]:
frame = pd.DataFrame(np.random.randn(4, 3), 
                     columns = list('bde'), 
                     index = ['Utah', 'Ohio', 'Texas', 'Oregan'])
print(frame)
# # print(np.abs(frame))
# print(frame['d'].min())
# print(frame['d'].max())
# print(frame['d'].max() - frame['d'].min())

# f = lambda x: x.max() - x.min()
# # df = frame.apply(f)
# # print(df, type(df))

# df = frame.apply(f, axis = 1)
# print(df)

def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])
df = frame.apply(min_max)
print(df, type(df))

               b         d         e
Utah   -2.180210 -0.262639 -0.467846
Ohio   -0.828886 -1.591730  0.336168
Texas   0.923124 -0.400319  0.609508
Oregan -0.941960  1.041214  0.989260
            b         d         e
min -2.180210 -1.591730 -0.467846
max  0.923124  1.041214  0.989260 <class 'pandas.core.frame.DataFrame'>

In [31]:
# Sorting and Ranking

frame = pd.DataFrame(np.arange(8).reshape((2, 4)), 
                    index = ['three', 'one'], 
                    columns = ['d', 'a', 'b', 'c'])
print(frame)
print()
print(frame.sort_index(axis=1, ascending=False))
print()
print(frame.sort_index())

# defaults in sort: axis = 0, ascending = True

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [32]:
# sort by values

print(frame.sort_values(by='b'))
print()
print(frame.rank(ascending=False, method='max'))
print()
print(frame.rank(ascending=True, method='min'))
print()
print(frame.rank(axis='columns'))

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

         d    a    b    c
three  2.0  2.0  2.0  2.0
one    1.0  1.0  1.0  1.0

         d    a    b    c
three  1.0  1.0  1.0  1.0
one    2.0  2.0  2.0  2.0

         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

In [33]:
# Summarizing and Computing Descriptive Statistics

df = pd.DataFrame([ [1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3] ], 
                 index = ['a', 'b', 'c', 'd'], 
                 columns = ['one', 'two'])
print(df)
print()
print(df.sum())
print()
print(df.sum(axis='columns'))

# note: use of skipna

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [34]:
# finding mean
print(df)
x = df.mean(axis='columns', skipna=True)   # average of columns
print()
print(x)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [35]:
# unique values

df = pd.DataFrame([ [1.4, 0.75], [1.4, -4.5], [np.nan, 0.5], [0.75, -1.3] ], 
                 index = ['a', 'b', 'c', 'd'], 
                 columns = ['one', 'two'])
print(df)
print()
print(df['one'].unique(), df['two'].unique())
print()
df['one'].value_counts()

    one   two
a  1.40  0.75
b  1.40 -4.50
c   NaN  0.50
d  0.75 -1.30

[1.4   nan 0.75] [ 0.75 -4.5   0.5  -1.3 ]

1.40    2
0.75    1
Name: one, dtype: int64

## Arithmetic and Data Alignment

In [46]:
# .loc and .iloc methods

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                     index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                     columns = ['one', "two", "three", "four"])
print(data_df)
print()
print(data_df.loc['Colorado', ['two', 'three']])
print()

# using number instead of label
print(data_df.iloc[ 2, [3, 0, 1]])
print()
print(data_df.iloc[:])             # It prints all data
print()
print(data_df.iloc[ : , :3 ])
print()
print(data_df.iloc[:2])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

two      5
three    6
Name: Colorado, dtype: int32

four    11
one      8
two      9
Name: Utah, dtype: int32

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three
Ohio        0    1      2
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [59]:
# + operation and .add method

df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)),
                  columns = list('bcd'),
                  index = ['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                  columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
print(df1)
print()

# df2.loc['Ohio', 'b'] = np.nan
print(df2)
print()

# Applying + operation btw two data frames
df3 = df1 + df2

print(df3)
print()

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [64]:
# .add method

df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns = list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                  columns = list('abcde'))
print(df1)
print()

df2.loc[1, 'b'] = np.nan
print(df2)
print()

df3 = df1 + df2
print(df3)
print()

df3 = df1.add(df2, fill_value=0)
print(df3)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [65]:
# Operations btw Data Frame and Series

In [70]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                  columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
print(frame)
print()
print(series)
print()
print(frame - series)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

## Deleting Data (Row or Column from df)

In [76]:
data_df = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                     index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                     columns = ['one', "two", "three", "four"])
print(data_df)
print()

data_df = data_df.drop('two', axis=1)    # It deletes column 2 from df
print(data_df)

# data_df.drop('two', axis=1, inplace=True)
# print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

# Reindex and ffill

In [98]:
import pandas as pd

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print(obj3)
print()

obj3 = obj3.reindex(range(9))
print(obj3)
print()

0      blue
3    purple
6    yellow
dtype: object

0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object

In [102]:
# ffill attribute

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 3, 6])
print(obj3)
print()

obj3 = obj3.reindex(range(9), method='ffill' )
print(obj3)

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

## working with Web APIs

In [4]:

import requests

import numpy as np
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
data = resp.json()
print(type(data))
print(data[0])

<class 'list'>
{'url': 'https://api.github.com/repos/pandas-dev/pandas/issues/36956', 'repository_url': 'https://api.github.com/repos/pandas-dev/pandas', 'labels_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/36956/labels{/name}', 'comments_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/36956/comments', 'events_url': 'https://api.github.com/repos/pandas-dev/pandas/issues/36956/events', 'html_url': 'https://github.com/pandas-dev/pandas/issues/36956', 'id': 716765466, 'node_id': 'MDU6SXNzdWU3MTY3NjU0NjY=', 'number': 36956, 'title': 'Add optional ./ci/code_checks.sh pre-commit', 'user': {'login': 'MarcoGorelli', 'id': 33491632, 'node_id': 'MDQ6VXNlcjMzNDkxNjMy', 'avatar_url': 'https://avatars2.githubusercontent.com/u/33491632?v=4', 'gravatar_id': '', 'url': 'https://api.github.com/users/MarcoGorelli', 'html_url': 'https://github.com/MarcoGorelli', 'followers_url': 'https://api.github.com/users/MarcoGorelli/followers', 'following_url': 'https://api.github.com/users/MarcoGorelli/following{/other_user}', 'gists_url': 'https://api.github.com/users/MarcoGorelli/gists{/gist_id}', 'starred_url': 'https://api.github.com/users/MarcoGorelli/starred{/owner}{/repo}', 'subscriptions_url': 'https://api.github.com/users/MarcoGorelli/subscriptions', 'organizations_url': 'https://api.github.com/users/MarcoGorelli/orgs', 'repos_url': 'https://api.github.com/users/MarcoGorelli/repos', 'events_url': 'https://api.github.com/users/MarcoGorelli/events{/privacy}', 'received_events_url': 'https://api.github.com/users/MarcoGorelli/received_events', 'type': 'User', 'site_admin': False}, 'labels': [{'id': 106935113, 'node_id': 'MDU6TGFiZWwxMDY5MzUxMTM=', 'url': 'https://api.github.com/repos/pandas-dev/pandas/labels/Style', 'name': 'Style', 'color': 'eb6420', 'default': False, 'description': 'Code style, linting, code_checks'}], 'state': 'open', 'locked': False, 'assignee': None, 'assignees': [], 'milestone': None, 'comments': 0, 'created_at': '2020-10-07T18:41:22Z', 'updated_at': '2020-10-07T18:41:36Z', 'closed_at': None, 'author_association': 'MEMBER', 'active_lock_reason': None, 'body': 'xref https://github.com/pandas-dev/pandas/pull/36722#issuecomment-704655928\r\n\r\n> Is there a way to have an option in code_checks.sh that actually runs the appropriate pre-commit hook? that way we have a single source of truth, and you can actually still run them (of course have to avoid running these on the CI from the script as well)', 'performed_via_github_app': None}

## working with Databases

In [6]:

import sqlite3

#creating table
query = """ CREATE TABLE test(a VARCHAR(20),
            b VARCHAR(20), c REAL,
            d INTEGER); """
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

OperationalError: table test already exists

In [9]:
# inserting data

data = [("Atlanta", "Georgia", 1.25, 6),
       ("Talahassee", "Florida", 2.6, 3),
       ("Sacramento", "California", 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [11]:
# Selecting/Extracting data

cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Talahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5), ('Atlanta', 'Georgia', 1.25, 6), ('Talahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5), ('Atlanta', 'Georgia', 1.25, 6), ('Talahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [15]:
import pandas as pd
print(cursor.description)
data_df = pd.DataFrame(rows, columns=[x[0] for x in cursor.description])
data_df

(('a', None, None, None, None, None, None), ('b', None, None, None, None, None, None), ('c', None, None, None, None, None, None), ('d', None, None, None, None, None, None))

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Talahassee     Florida  2.60  3
2  Sacramento  California  1.70  5
3     Atlanta     Georgia  1.25  6
4  Talahassee     Florida  2.60  3
5  Sacramento  California  1.70  5
6     Atlanta     Georgia  1.25  6
7  Talahassee     Florida  2.60  3
8  Sacramento  California  1.70  5

In [2]:
# using sqlalchemy

import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

            a           b     c  d
0     Atlanta     Georgia  1.25  6
1  Talahassee     Florida  2.60  3
2  Sacramento  California  1.70  5
3     Atlanta     Georgia  1.25  6
4  Talahassee     Florida  2.60  3
5  Sacramento  California  1.70  5
6     Atlanta     Georgia  1.25  6
7  Talahassee     Florida  2.60  3
8  Sacramento  California  1.70  5

## Handling Missing Data

In [12]:
import pandas as pd

from numpy import nan as NA

data = pd.DataFrame([[1., 6.5, NA], [NA, NA, NA], [1., NA, NA], [NA, 6.5, NA]], columns=list('abc'))
print(data)

clean = data.dropna()
print()
print(clean)

cleaned = data.dropna(how='all')
print()
print(cleaned)

data.dropna(axis=1, how='all')

     a    b   c
0  1.0  6.5 NaN
1  NaN  NaN NaN
2  1.0  NaN NaN
3  NaN  6.5 NaN

Empty DataFrame
Columns: [a, b, c]
Index: []

     a    b   c
0  1.0  6.5 NaN
2  1.0  NaN NaN
3  NaN  6.5 NaN

     a    b
0  1.0  6.5
1  NaN  NaN
2  1.0  NaN
3  NaN  6.5

## Removing Duplicates

In [19]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]} )
data['v1'] = ['one', 'two', 'one', 'four', 'one', 'six', 'two']
print(data)

data.drop_duplicates()
print()
data = data.drop_duplicates(['k1', 'v1'])
data

    k1  k2    v1
0  one   1   one
1  two   1   two
2  one   2   one
3  two   3  four
4  one   3   one
5  two   4   six
6  two   4   two

    k1  k2    v1
0  one   1   one
1  two   1   two
3  two   3  four
5  two   4   six

## Replacing Values

In [27]:
df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
print(df)
print()

df = df.replace(np.nan, -999)
print(df)
print()
df = df.replace(-999, -9)
print(df)

          0         1         2
0 -2.474942       NaN       NaN
1 -0.685327       NaN       NaN
2  1.855492       NaN -0.288818
3 -0.266448       NaN  0.121726
4 -0.295524  0.019023  1.398198
5 -0.734493 -2.166516  1.782702
6  0.509475  1.071673 -0.223451

          0           1           2
0 -2.474942 -999.000000 -999.000000
1 -0.685327 -999.000000 -999.000000
2  1.855492 -999.000000   -0.288818
3 -0.266448 -999.000000    0.121726
4 -0.295524    0.019023    1.398198
5 -0.734493   -2.166516    1.782702
6  0.509475    1.071673   -0.223451

          0         1         2
0 -2.474942 -9.000000 -9.000000
1 -0.685327 -9.000000 -9.000000
2  1.855492 -9.000000 -0.288818
3 -0.266448 -9.000000  0.121726
4 -0.295524  0.019023  1.398198
5 -0.734493 -2.166516  1.782702
6  0.509475  1.071673 -0.223451

## Regular Expression

In [35]:

import re

text = " foo    bar\t  baz  \tqux"
# text.split()
rg = re.split('\s+', text)    #splitting based on whitespaces
print(rg)
print()
rgx = re.compile("\s+")
rgx.split(text)

['', 'foo', 'bar', 'baz', 'qux']

['', 'foo', 'bar', 'baz', 'qux']

## Hierarichal Indexing

In [8]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),
                index = [ ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                          [1, 2, 3, 1, 3, 1, 2, 2, 3] ] )
display(data)

a  1    3.046812
   2   -0.570266
   3    0.114088
b  1    0.587067
   3    0.499626
c  1   -0.667479
   2    0.329102
d  2    1.244875
   3    0.855108
dtype: float64

In [10]:
display(data['a'])

1    3.046812
2   -0.570266
3    0.114088
dtype: float64

In [18]:
data.loc[:, 2]     # i can excess inner level of index, which will select all upper index at level 1

a   -0.570266
c    0.329102
d    1.244875
dtype: float64

In [21]:
df = data.unstack()
df

          1         2         3
a  3.046812 -0.570266  0.114088
b  0.587067       NaN  0.499626
c -0.667479  0.329102       NaN
d       NaN  1.244875  0.855108

In [26]:
frame = pd.DataFrame(np.arange(12).reshape(4, 3), 
                    index = [['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                    columns = [['Ohio', 'Ohio', 'Colorado'], 
                              ['Green', 'Red', 'Green']] )
display(frame)
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
print()
display(frame)

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [28]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [30]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [35]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

## Summary Statistics by level

In [39]:
display(frame)
frame.sum(level= 'key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [42]:
frame.sum(level='color', axis= 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

## Combining and Merging Datasets

In [49]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

dsp1 = pd.merge(df1, df2, on='key')
display(dsp1)
dsp2 = pd.merge(df3, df4, left_on='lkey', right_on='rkey')
display(dsp2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

## Pivoting

In [61]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'], 
                  'A': [1, 2, 3], 
                  'B': [4, 5, 6], 
                  'C': [7, 8, 9]})
display(df)
melted = pd.melt(df, ['key'])
display(melted)

melted.pivot(index='key', columns='variable', values='value')

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7